In [2]:
import pandas as pd

In [3]:
archivo = 'train.csv'

In [5]:
df = pd.read_csv(archivo)
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [7]:
columnas_ingles = df.columns
columnas_ingles

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
columnas_espanol = ['Id_pasajero', 'Sobrevivio', 'Clase', 'Nombre', 'Sexo', 'Edad', 'SibSp', 'Parch', 'Billete', 'Tarifa', 'NumCabina', 'Embarcar']
df.columns = columnas_espanol
df.columns

Index(['Id_pasajero', 'Sobrevivio', 'Clase', 'Nombre', 'Sexo', 'Edad', 'SibSp',
       'Parch', 'Billete', 'Tarifa', 'NumCabina', 'Embarcar'],
      dtype='object')

In [12]:
df.loc[3:8,['Clase', 'Nombre', 'Edad']]

   Clase                                             Nombre  Edad
3      1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4      3                           Allen, Mr. William Henry  35.0
5      3                                   Moran, Mr. James   NaN
6      1                            McCarthy, Mr. Timothy J  54.0
7      3                     Palsson, Master. Gosta Leonard   2.0
8      3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0

In [17]:
df.groupby(['Sobrevivio']).size()

Sobrevivio
0    549
1    342
dtype: int64

In [25]:
df.groupby(['Sobrevivio']).sum()

            Id_pasajero  Clase      Edad  SibSp  Parch      Tarifa
Sobrevivio
0                245412   1390  12985.50    304    181  12142.7199
1                151974    667   8219.67    162    159  16551.2294

In [27]:
df.groupby(['Sobrevivio']).mean()

            Id_pasajero     Clase       Edad     SibSp     Parch     Tarifa
Sobrevivio
0            447.016393  2.531876  30.626179  0.553734  0.329690  22.117887
1            444.368421  1.950292  28.343690  0.473684  0.464912  48.395408

In [29]:
df['Sobrevivio'].min()

0

In [30]:
df['Sobrevivio'].max()

1

In [31]:
df['Sobrevivio'].mean()

0.3838383838383838